int meiroSize=11; 
final float upleft = 82.5;//左上

//A.0=壁あり、B.1=壁なし、C.2=Start、D.3=Goal
int[][] meiro={{  0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, }, 
  {  0, 2, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 0, }, 
  {  0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 0, }, 
  {  0, 1, 1, 1, 1, 0, 1, 1, 0, 0, 0, 1, 0, }, 
  {  0, 1, 0, 1, 0, 1, 1, 0, 0, 1, 1, 1, 0, }, 
  {  0, 1, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, }, 
  {  0, 1, 1, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, }, 
  {  0, 1, 0, 0, 1, 1, 1, 1, 0, 1, 0, 1, 0, }, 
  {  0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 1, 1, 0, }, 
  {  0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 1, 0, }, 
  {  0, 1, 1, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, }, 
  {  0, 0, 1, 0, 1, 1, 1, 1, 1, 1, 0, 3, 0, }, 
  {  0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, }};

void dispMap() {
  rect(-1*upleft, -1*upleft, cir_radi*(meiroSize), cir_radi*(meiroSize));
  for (int i=1; i<=meiroSize; i++) {
    for (int j=1; j<=meiroSize; j++) {
      if (meiro[i][j]==0) {
        float I=(i-1)*cir_radi-upleft, J=(j-1)*cir_radi-upleft;
        //   println("(I,J) = "+I, J);
        rect(I, J, cir_radi, cir_radi);
      }
      if (i==meiroSize && i==j) {
        rect(67.5, 67.5, 15, 15, -15);
      }
    }
  }
  text("G", 67.5, 67.5, 15, 15);
}
